Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperation_t
Data structure for Building Hierarchy data retrieval operations.

Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperation_t.ClientId
Client id for data retrieval operation (used for getting string lists).

Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperation_t.aParentGuid
Guid of the Building Hierarchy parent object.

Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperation_t.OverrideObjectId
Id of the overridden model object.

Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperation_t.OperationType
Type of the override operation.